RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dma2d_reg.h
/**
  ******************************************************************************
  * @file    dma2d_reg.h
  * @version V1.0
  * @date    2021-09-10
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __DMA2D_REG_H__
#define __DMA2D_REG_H__

#include "bl808.h"

/* 0x0 : DMA_IntStatus */
#define DMA2D_DMA_INTSTATUS_OFFSET (0x0)
#define DMA2D_INTSTATUS            DMA2D_INTSTATUS
#define DMA2D_INTSTATUS_POS        (0U)
#define DMA2D_INTSTATUS_LEN        (8U)
#define DMA2D_INTSTATUS_MSK        (((1U << DMA2D_INTSTATUS_LEN) - 1) << DMA2D_INTSTATUS_POS)
#define DMA2D_INTSTATUS_UMSK       (~(((1U << DMA2D_INTSTATUS_LEN) - 1) << DMA2D_INTSTATUS_POS))

/* 0x4 : DMA_IntTCStatus */
#define DMA2D_DMA_INTTCSTATUS_OFFSET (0x4)
#define DMA2D_INTTCSTATUS            DMA2D_INTTCSTATUS
#define DMA2D_INTTCSTATUS_POS        (0U)
#define DMA2D_INTTCSTATUS_LEN        (8U)
#define DMA2D_INTTCSTATUS_MSK        (((1U << DMA2D_INTTCSTATUS_LEN) - 1) << DMA2D_INTTCSTATUS_POS)
#define DMA2D_INTTCSTATUS_UMSK       (~(((1U << DMA2D_INTTCSTATUS_LEN) - 1) << DMA2D_INTTCSTATUS_POS))

/* 0x8 : DMA_IntTCClear */
#define DMA2D_DMA_INTTCCLEAR_OFFSET (0x8)
#define DMA2D_INTTCCLEAR            DMA2D_INTTCCLEAR
#define DMA2D_INTTCCLEAR_POS        (0U)
#define DMA2D_INTTCCLEAR_LEN        (8U)
#define DMA2D_INTTCCLEAR_MSK        (((1U << DMA2D_INTTCCLEAR_LEN) - 1) << DMA2D_INTTCCLEAR_POS)
#define DMA2D_INTTCCLEAR_UMSK       (~(((1U << DMA2D_INTTCCLEAR_LEN) - 1) << DMA2D_INTTCCLEAR_POS))

/* 0xC : DMA_EnbldChns */
#define DMA2D_DMA_ENBLDCHNS_OFFSET (0xC)
#define DMA2D_ENABLEDCHANNELS      DMA2D_ENABLEDCHANNELS
#define DMA2D_ENABLEDCHANNELS_POS  (0U)
#define DMA2D_ENABLEDCHANNELS_LEN  (8U)
#define DMA2D_ENABLEDCHANNELS_MSK  (((1U << DMA2D_ENABLEDCHANNELS_LEN) - 1) << DMA2D_ENABLEDCHANNELS_POS)
#define DMA2D_ENABLEDCHANNELS_UMSK (~(((1U << DMA2D_ENABLEDCHANNELS_LEN) - 1) << DMA2D_ENABLEDCHANNELS_POS))

/* 0x10 : DMA_Config */
#define DMA2D_DMA_CONFIG_OFFSET (0x10)
#define DMA2D_E                 DMA2D_E
#define DMA2D_E_POS             (0U)
#define DMA2D_E_LEN             (1U)
#define DMA2D_E_MSK             (((1U << DMA2D_E_LEN) - 1) << DMA2D_E_POS)
#define DMA2D_E_UMSK            (~(((1U << DMA2D_E_LEN) - 1) << DMA2D_E_POS))
#define DMA2D_CHCLKCG           DMA2D_CHCLKCG
#define DMA2D_CHCLKCG_POS       (16U)
#define DMA2D_CHCLKCG_LEN       (8U)
#define DMA2D_CHCLKCG_MSK       (((1U << DMA2D_CHCLKCG_LEN) - 1) << DMA2D_CHCLKCG_POS)
#define DMA2D_CHCLKCG_UMSK      (~(((1U << DMA2D_CHCLKCG_LEN) - 1) << DMA2D_CHCLKCG_POS))

/* 0x14 : DMA_Sync */
#define DMA2D_DMA_SYNC_OFFSET (0x14)
#define DMA2D_DMA_SYNC        DMA2D_DMA_SYNC
#define DMA2D_DMA_SYNC_POS    (0U)
#define DMA2D_DMA_SYNC_LEN    (32U)
#define DMA2D_DMA_SYNC_MSK    (((1U << DMA2D_DMA_SYNC_LEN) - 1) << DMA2D_DMA_SYNC_POS)
#define DMA2D_DMA_SYNC_UMSK   (~(((1U << DMA2D_DMA_SYNC_LEN) - 1) << DMA2D_DMA_SYNC_POS))

/* 0x18 : DMA_SoftBReq */
#define DMA2D_DMA_SOFTBREQ_OFFSET (0x18)
#define DMA2D_SOFTBREQ            DMA2D_SOFTBREQ
#define DMA2D_SOFTBREQ_POS        (0U)
#define DMA2D_SOFTBREQ_LEN        (32U)
#define DMA2D_SOFTBREQ_MSK        (((1U << DMA2D_SOFTBREQ_LEN) - 1) << DMA2D_SOFTBREQ_POS)
#define DMA2D_SOFTBREQ_UMSK       (~(((1U << DMA2D_SOFTBREQ_LEN) - 1) << DMA2D_SOFTBREQ_POS))

/* 0x1C : DMA_SoftLBReq */
#define DMA2D_DMA_SOFTLBREQ_OFFSET (0x1C)
#define DMA2D_SOFTLBREQ            DMA2D_SOFTLBREQ
#define DMA2D_SOFTLBREQ_POS        (0U)
#define DMA2D_SOFTLBREQ_LEN        (32U)
#define DMA2D_SOFTLBREQ_MSK        (((1U << DMA2D_SOFTLBREQ_LEN) - 1) << DMA2D_SOFTLBREQ_POS)
#define DMA2D_SOFTLBREQ_UMSK       (~(((1U << DMA2D_SOFTLBREQ_LEN) - 1) << DMA2D_SOFTLBREQ_POS))

/* 0x20 : DMA_SoftSReq */
#define DMA2D_DMA_SOFTSREQ_OFFSET (0x20)
#define DMA2D_SOFTSREQ            DMA2D_SOFTSREQ
#define DMA2D_SOFTSREQ_POS        (0U)
#define DMA2D_SOFTSREQ_LEN        (32U)
#define DMA2D_SOFTSREQ_MSK        (((1U << DMA2D_SOFTSREQ_LEN) - 1) << DMA2D_SOFTSREQ_POS)
#define DMA2D_SOFTSREQ_UMSK       (~(((1U << DMA2D_SOFTSREQ_LEN) - 1) << DMA2D_SOFTSREQ_POS))

/* 0x24 : DMA_SoftLSReq */
#define DMA2D_DMA_SOFTLSREQ_OFFSET (0x24)
#define DMA2D_SOFTLSREQ            DMA2D_SOFTLSREQ
#define DMA2D_SOFTLSREQ_POS        (0U)
#define DMA2D_SOFTLSREQ_LEN        (32U)
#define DMA2D_SOFTLSREQ_MSK        (((1U << DMA2D_SOFTLSREQ_LEN) - 1) << DMA2D_SOFTLSREQ_POS)
#define DMA2D_SOFTLSREQ_UMSK       (~(((1U << DMA2D_SOFTLSREQ_LEN) - 1) << DMA2D_SOFTLSREQ_POS))

/* 0x100 : DMA2D_C0SrcAddr */
#define DMA2D_C0SRCADDR_OFFSET (0x100)
#define DMA2D_SRCADDR          DMA2D_SRCADDR
#define DMA2D_SRCADDR_POS      (0U)
#define DMA2D_SRCADDR_LEN      (32U)
#define DMA2D_SRCADDR_MSK      (((1U << DMA2D_SRCADDR_LEN) - 1) << DMA2D_SRCADDR_POS)
#define DMA2D_SRCADDR_UMSK     (~(((1U << DMA2D_SRCADDR_LEN) - 1) << DMA2D_SRCADDR_POS))

/* 0x104 : DMA2D_C0DstAddr */
#define DMA2D_C0DSTADDR_OFFSET (0x104)
#define DMA2D_DSTADDR          DMA2D_DSTADDR
#define DMA2D_DSTADDR_POS      (0U)
#define DMA2D_DSTADDR_LEN      (32U)
#define DMA2D_DSTADDR_MSK      (((1U << DMA2D_DSTADDR_LEN) - 1) << DMA2D_DSTADDR_POS)
#define DMA2D_DSTADDR_UMSK     (~(((1U << DMA2D_DSTADDR_LEN) - 1) << DMA2D_DSTADDR_POS))

/* 0x108 : DMA2D_C0LLI */
#define DMA2D_C0LLI_OFFSET  (0x108)
#define DMA2D_LLI_EN        DMA2D_LLI_EN
#define DMA2D_LLI_EN_POS    (0U)
#define DMA2D_LLI_EN_LEN    (1U)
#define DMA2D_LLI_EN_MSK    (((1U << DMA2D_LLI_EN_LEN) - 1) << DMA2D_LLI_EN_POS)
#define DMA2D_LLI_EN_UMSK   (~(((1U << DMA2D_LLI_EN_LEN) - 1) << DMA2D_LLI_EN_POS))
#define DMA2D_LLI_ADDR      DMA2D_LLI_ADDR
#define DMA2D_LLI_ADDR_POS  (2U)
#define DMA2D_LLI_ADDR_LEN  (30U)
#define DMA2D_LLI_ADDR_MSK  (((1U << DMA2D_LLI_ADDR_LEN) - 1) << DMA2D_LLI_ADDR_POS)
#define DMA2D_LLI_ADDR_UMSK (~(((1U << DMA2D_LLI_ADDR_LEN) - 1) << DMA2D_LLI_ADDR_POS))

/* 0x10C : DMA2D_C0_BUS */
#define DMA2D_C0_BUS_OFFSET     (0x10C)
#define DMA2D_TRANSFERSIZE      DMA2D_TRANSFERSIZE
#define DMA2D_TRANSFERSIZE_POS  (0U)
#define DMA2D_TRANSFERSIZE_LEN  (12U)
#define DMA2D_TRANSFERSIZE_MSK  (((1U << DMA2D_TRANSFERSIZE_LEN) - 1) << DMA2D_TRANSFERSIZE_POS)
#define DMA2D_TRANSFERSIZE_UMSK (~(((1U << DMA2D_TRANSFERSIZE_LEN) - 1) << DMA2D_TRANSFERSIZE_POS))
#define DMA2D_SRC_BURST         DMA2D_SRC_BURST
#define DMA2D_SRC_BURST_POS     (12U)
#define DMA2D_SRC_BURST_LEN     (2U)
#define DMA2D_SRC_BURST_MSK     (((1U << DMA2D_SRC_BURST_LEN) - 1) << DMA2D_SRC_BURST_POS)
#define DMA2D_SRC_BURST_UMSK    (~(((1U << DMA2D_SRC_BURST_LEN) - 1) << DMA2D_SRC_BURST_POS))
#define DMA2D_DST_BURST         DMA2D_DST_BURST
#define DMA2D_DST_BURST_POS     (15U)
#define DMA2D_DST_BURST_LEN     (2U)
#define DMA2D_DST_BURST_MSK     (((1U << DMA2D_DST_BURST_LEN) - 1) << DMA2D_DST_BURST_POS)
#define DMA2D_DST_BURST_UMSK    (~(((1U << DMA2D_DST_BURST_LEN) - 1) << DMA2D_DST_BURST_POS))
#define DMA2D_SRC_SIZE          DMA2D_SRC_SIZE
#define DMA2D_SRC_SIZE_POS      (18U)
#define DMA2D_SRC_SIZE_LEN      (2U)
#define DMA2D_SRC_SIZE_MSK      (((1U << DMA2D_SRC_SIZE_LEN) - 1) << DMA2D_SRC_SIZE_POS)
#define DMA2D_SRC_SIZE_UMSK     (~(((1U << DMA2D_SRC_SIZE_LEN) - 1) << DMA2D_SRC_SIZE_POS))
#define DMA2D_DST_SIZE          DMA2D_DST_SIZE
#define DMA2D_DST_SIZE_POS      (21U)
#define DMA2D_DST_SIZE_LEN      (2U)
#define DMA2D_DST_SIZE_MSK      (((1U << DMA2D_DST_SIZE_LEN) - 1) << DMA2D_DST_SIZE_POS)
#define DMA2D_DST_SIZE_UMSK     (~(((1U << DMA2D_DST_SIZE_LEN) - 1) << DMA2D_DST_SIZE_POS))
#define DMA2D_SI                DMA2D_SI
#define DMA2D_SI_POS            (26U)
#define DMA2D_SI_LEN            (1U)
#define DMA2D_SI_MSK            (((1U << DMA2D_SI_LEN) - 1) << DMA2D_SI_POS)
#define DMA2D_SI_UMSK           (~(((1U << DMA2D_SI_LEN) - 1) << DMA2D_SI_POS))
#define DMA2D_DI                DMA2D_DI
#define DMA2D_DI_POS            (27U)
#define DMA2D_DI_LEN            (1U)
#define DMA2D_DI_MSK            (((1U << DMA2D_DI_LEN) - 1) << DMA2D_DI_POS)
#define DMA2D_DI_UMSK           (~(((1U << DMA2D_DI_LEN) - 1) << DMA2D_DI_POS))
#define DMA2D_PROT              DMA2D_PROT
#define DMA2D_PROT_POS          (28U)
#define DMA2D_PROT_LEN          (3U)
#define DMA2D_PROT_MSK          (((1U << DMA2D_PROT_LEN) - 1) << DMA2D_PROT_POS)
#define DMA2D_PROT_UMSK         (~(((1U << DMA2D_PROT_LEN) - 1) << DMA2D_PROT_POS))
#define DMA2D_I                 DMA2D_I
#define DMA2D_I_POS             (31U)
#define DMA2D_I_LEN             (1U)
#define DMA2D_I_MSK             (((1U << DMA2D_I_LEN) - 1) << DMA2D_I_POS)
#define DMA2D_I_UMSK            (~(((1U << DMA2D_I_LEN) - 1) << DMA2D_I_POS))

/* 0x110 : DMA2D_C0_SRC_CNT */
#define DMA2D_C0_SRC_CNT_OFFSET (0x110)
#define DMA2D_SRC_X_CNT         DMA2D_SRC_X_CNT
#define DMA2D_SRC_X_CNT_POS     (0U)
#define DMA2D_SRC_X_CNT_LEN     (16U)
#define DMA2D_SRC_X_CNT_MSK     (((1U << DMA2D_SRC_X_CNT_LEN) - 1) << DMA2D_SRC_X_CNT_POS)
#define DMA2D_SRC_X_CNT_UMSK    (~(((1U << DMA2D_SRC_X_CNT_LEN) - 1) << DMA2D_SRC_X_CNT_POS))
#define DMA2D_SRC_Y_CNT         DMA2D_SRC_Y_CNT
#define DMA2D_SRC_Y_CNT_POS     (16U)
#define DMA2D_SRC_Y_CNT_LEN     (16U)
#define DMA2D_SRC_Y_CNT_MSK     (((1U << DMA2D_SRC_Y_CNT_LEN) - 1) << DMA2D_SRC_Y_CNT_POS)
#define DMA2D_SRC_Y_CNT_UMSK    (~(((1U << DMA2D_SRC_Y_CNT_LEN) - 1) << DMA2D_SRC_Y_CNT_POS))

/* 0x114 : DMA2D_C0_SRC_XIC */
#define DMA2D_C0_SRC_XIC_OFFSET (0x114)
#define DMA2D_SRC_X_INCR        DMA2D_SRC_X_INCR
#define DMA2D_SRC_X_INCR_POS    (0U)
#define DMA2D_SRC_X_INCR_LEN    (32U)
#define DMA2D_SRC_X_INCR_MSK    (((1U << DMA2D_SRC_X_INCR_LEN) - 1) << DMA2D_SRC_X_INCR_POS)
#define DMA2D_SRC_X_INCR_UMSK   (~(((1U << DMA2D_SRC_X_INCR_LEN) - 1) << DMA2D_SRC_X_INCR_POS))

/* 0x118 : DMA2D_C0_SRC_YIC */
#define DMA2D_C0_SRC_YIC_OFFSET (0x118)
#define DMA2D_SRC_Y_INCR        DMA2D_SRC_Y_INCR
#define DMA2D_SRC_Y_INCR_POS    (0U)
#define DMA2D_SRC_Y_INCR_LEN    (32U)
#define DMA2D_SRC_Y_INCR_MSK    (((1U << DMA2D_SRC_Y_INCR_LEN) - 1) << DMA2D_SRC_Y_INCR_POS)
#define DMA2D_SRC_Y_INCR_UMSK   (~(((1U << DMA2D_SRC_Y_INCR_LEN) - 1) << DMA2D_SRC_Y_INCR_POS))

/* 0x11C : DMA2D_C0_DST_CNT */
#define DMA2D_C0_DST_CNT_OFFSET (0x11C)
#define DMA2D_DST_X_CNT         DMA2D_DST_X_CNT
#define DMA2D_DST_X_CNT_POS     (0U)
#define DMA2D_DST_X_CNT_LEN     (16U)
#define DMA2D_DST_X_CNT_MSK     (((1U << DMA2D_DST_X_CNT_LEN) - 1) << DMA2D_DST_X_CNT_POS)
#define DMA2D_DST_X_CNT_UMSK    (~(((1U << DMA2D_DST_X_CNT_LEN) - 1) << DMA2D_DST_X_CNT_POS))

