RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dma2d_reg.h
/* 0x120 : DMA2D_C0_DST_XIC */
#define DMA2D_C0_DST_XIC_OFFSET (0x120)
#define DMA2D_DST_X_INCR        DMA2D_DST_X_INCR
#define DMA2D_DST_X_INCR_POS    (0U)
#define DMA2D_DST_X_INCR_LEN    (32U)
#define DMA2D_DST_X_INCR_MSK    (((1U << DMA2D_DST_X_INCR_LEN) - 1) << DMA2D_DST_X_INCR_POS)
#define DMA2D_DST_X_INCR_UMSK   (~(((1U << DMA2D_DST_X_INCR_LEN) - 1) << DMA2D_DST_X_INCR_POS))

/* 0x124 : DMA2D_C0_DST_YIC */
#define DMA2D_C0_DST_YIC_OFFSET (0x124)
#define DMA2D_DST_Y_INCR        DMA2D_DST_Y_INCR
#define DMA2D_DST_Y_INCR_POS    (0U)
#define DMA2D_DST_Y_INCR_LEN    (32U)
#define DMA2D_DST_Y_INCR_MSK    (((1U << DMA2D_DST_Y_INCR_LEN) - 1) << DMA2D_DST_Y_INCR_POS)
#define DMA2D_DST_Y_INCR_UMSK   (~(((1U << DMA2D_DST_Y_INCR_LEN) - 1) << DMA2D_DST_Y_INCR_POS))

/* 0x174 : DMA2D_C0_KEY */
#define DMA2D_C0_KEY_OFFSET (0x174)
#define DMA2D_KEY0          DMA2D_KEY0
#define DMA2D_KEY0_POS      (0U)
#define DMA2D_KEY0_LEN      (8U)
#define DMA2D_KEY0_MSK      (((1U << DMA2D_KEY0_LEN) - 1) << DMA2D_KEY0_POS)
#define DMA2D_KEY0_UMSK     (~(((1U << DMA2D_KEY0_LEN) - 1) << DMA2D_KEY0_POS))
#define DMA2D_KEY1          DMA2D_KEY1
#define DMA2D_KEY1_POS      (8U)
#define DMA2D_KEY1_LEN      (8U)
#define DMA2D_KEY1_MSK      (((1U << DMA2D_KEY1_LEN) - 1) << DMA2D_KEY1_POS)
#define DMA2D_KEY1_UMSK     (~(((1U << DMA2D_KEY1_LEN) - 1) << DMA2D_KEY1_POS))
#define DMA2D_KEY2          DMA2D_KEY2
#define DMA2D_KEY2_POS      (16U)
#define DMA2D_KEY2_LEN      (8U)
#define DMA2D_KEY2_MSK      (((1U << DMA2D_KEY2_LEN) - 1) << DMA2D_KEY2_POS)
#define DMA2D_KEY2_UMSK     (~(((1U << DMA2D_KEY2_LEN) - 1) << DMA2D_KEY2_POS))
#define DMA2D_KEY3          DMA2D_KEY3
#define DMA2D_KEY3_POS      (24U)
#define DMA2D_KEY3_LEN      (8U)
#define DMA2D_KEY3_MSK      (((1U << DMA2D_KEY3_LEN) - 1) << DMA2D_KEY3_POS)
#define DMA2D_KEY3_UMSK     (~(((1U << DMA2D_KEY3_LEN) - 1) << DMA2D_KEY3_POS))

/* 0x178 : DMA2D_C0_KEY_EN */
#define DMA2D_C0_KEY_EN_OFFSET (0x178)
#define DMA2D_KEY_EN           DMA2D_KEY_EN
#define DMA2D_KEY_EN_POS       (0U)
#define DMA2D_KEY_EN_LEN       (1U)
#define DMA2D_KEY_EN_MSK       (((1U << DMA2D_KEY_EN_LEN) - 1) << DMA2D_KEY_EN_POS)
#define DMA2D_KEY_EN_UMSK      (~(((1U << DMA2D_KEY_EN_LEN) - 1) << DMA2D_KEY_EN_POS))
#define DMA2D_KEY_MODE         DMA2D_KEY_MODE
#define DMA2D_KEY_MODE_POS     (1U)
#define DMA2D_KEY_MODE_LEN     (2U)
#define DMA2D_KEY_MODE_MSK     (((1U << DMA2D_KEY_MODE_LEN) - 1) << DMA2D_KEY_MODE_POS)
#define DMA2D_KEY_MODE_UMSK    (~(((1U << DMA2D_KEY_MODE_LEN) - 1) << DMA2D_KEY_MODE_POS))
#define DMA2D_KEY_STRB         DMA2D_KEY_STRB
#define DMA2D_KEY_STRB_POS     (4U)
#define DMA2D_KEY_STRB_LEN     (4U)
#define DMA2D_KEY_STRB_MSK     (((1U << DMA2D_KEY_STRB_LEN) - 1) << DMA2D_KEY_STRB_POS)
#define DMA2D_KEY_STRB_UMSK    (~(((1U << DMA2D_KEY_STRB_LEN) - 1) << DMA2D_KEY_STRB_POS))

/* 0x17C : DMA2D_C0_CFG */
#define DMA2D_C0_CFG_OFFSET      (0x17C)
#define DMA2D_CH_EN              DMA2D_CH_EN
#define DMA2D_CH_EN_POS          (0U)
#define DMA2D_CH_EN_LEN          (1U)
#define DMA2D_CH_EN_MSK          (((1U << DMA2D_CH_EN_LEN) - 1) << DMA2D_CH_EN_POS)
#define DMA2D_CH_EN_UMSK         (~(((1U << DMA2D_CH_EN_LEN) - 1) << DMA2D_CH_EN_POS))
#define DMA2D_SRCPERIPHERAL      DMA2D_SRCPERIPHERAL
#define DMA2D_SRCPERIPHERAL_POS  (1U)
#define DMA2D_SRCPERIPHERAL_LEN  (5U)
#define DMA2D_SRCPERIPHERAL_MSK  (((1U << DMA2D_SRCPERIPHERAL_LEN) - 1) << DMA2D_SRCPERIPHERAL_POS)
#define DMA2D_SRCPERIPHERAL_UMSK (~(((1U << DMA2D_SRCPERIPHERAL_LEN) - 1) << DMA2D_SRCPERIPHERAL_POS))
#define DMA2D_DSTPERIPHERAL      DMA2D_DSTPERIPHERAL
#define DMA2D_DSTPERIPHERAL_POS  (6U)
#define DMA2D_DSTPERIPHERAL_LEN  (5U)
#define DMA2D_DSTPERIPHERAL_MSK  (((1U << DMA2D_DSTPERIPHERAL_LEN) - 1) << DMA2D_DSTPERIPHERAL_POS)
#define DMA2D_DSTPERIPHERAL_UMSK (~(((1U << DMA2D_DSTPERIPHERAL_LEN) - 1) << DMA2D_DSTPERIPHERAL_POS))
#define DMA2D_FLOWCNTRL          DMA2D_FLOWCNTRL
#define DMA2D_FLOWCNTRL_POS      (11U)
#define DMA2D_FLOWCNTRL_LEN      (3U)
#define DMA2D_FLOWCNTRL_MSK      (((1U << DMA2D_FLOWCNTRL_LEN) - 1) << DMA2D_FLOWCNTRL_POS)
#define DMA2D_FLOWCNTRL_UMSK     (~(((1U << DMA2D_FLOWCNTRL_LEN) - 1) << DMA2D_FLOWCNTRL_POS))
#define DMA2D_AHB_B2B            DMA2D_AHB_B2B
#define DMA2D_AHB_B2B_POS        (14U)
#define DMA2D_AHB_B2B_LEN        (1U)
#define DMA2D_AHB_B2B_MSK        (((1U << DMA2D_AHB_B2B_LEN) - 1) << DMA2D_AHB_B2B_POS)
#define DMA2D_AHB_B2B_UMSK       (~(((1U << DMA2D_AHB_B2B_LEN) - 1) << DMA2D_AHB_B2B_POS))
#define DMA2D_FIFO_EMPTY         DMA2D_FIFO_EMPTY
#define DMA2D_FIFO_EMPTY_POS     (16U)
#define DMA2D_FIFO_EMPTY_LEN     (1U)
#define DMA2D_FIFO_EMPTY_MSK     (((1U << DMA2D_FIFO_EMPTY_LEN) - 1) << DMA2D_FIFO_EMPTY_POS)
#define DMA2D_FIFO_EMPTY_UMSK    (~(((1U << DMA2D_FIFO_EMPTY_LEN) - 1) << DMA2D_FIFO_EMPTY_POS))
#define DMA2D_LLICOUNTER         DMA2D_LLICOUNTER
#define DMA2D_LLICOUNTER_POS     (20U)
#define DMA2D_LLICOUNTER_LEN     (10U)
#define DMA2D_LLICOUNTER_MSK     (((1U << DMA2D_LLICOUNTER_LEN) - 1) << DMA2D_LLICOUNTER_POS)
#define DMA2D_LLICOUNTER_UMSK    (~(((1U << DMA2D_LLICOUNTER_LEN) - 1) << DMA2D_LLICOUNTER_POS))
#define DMA2D_REG_DMA_2D_EN      DMA2D_REG_DMA_2D_EN
#define DMA2D_REG_DMA_2D_EN_POS  (31U)
#define DMA2D_REG_DMA_2D_EN_LEN  (1U)
#define DMA2D_REG_DMA_2D_EN_MSK  (((1U << DMA2D_REG_DMA_2D_EN_LEN) - 1) << DMA2D_REG_DMA_2D_EN_POS)
#define DMA2D_REG_DMA_2D_EN_UMSK (~(((1U << DMA2D_REG_DMA_2D_EN_LEN) - 1) << DMA2D_REG_DMA_2D_EN_POS))

struct dma2d_reg {
    /* 0x0 : DMA_IntStatus */
    union {
        struct {
            uint32_t IntStatus     : 8;  /* [ 7: 0],          r,        0x0 */
            uint32_t reserved_8_31 : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_IntStatus;

    /* 0x4 : DMA_IntTCStatus */
    union {
        struct {
            uint32_t IntTCStatus   : 8;  /* [ 7: 0],          r,        0x0 */
            uint32_t reserved_8_31 : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_IntTCStatus;

