RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dma2d_reg.h
    /* 0x8 : DMA_IntTCClear */
    union {
        struct {
            uint32_t IntTCClear    : 8;  /* [ 7: 0],        w1p,        0x0 */
            uint32_t reserved_8_31 : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_IntTCClear;

    /* 0xC : DMA_EnbldChns */
    union {
        struct {
            uint32_t EnabledChannels : 8;  /* [ 7: 0],          r,        0x0 */
            uint32_t reserved_8_31   : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_EnbldChns;

    /* 0x10 : DMA_Config */
    union {
        struct {
            uint32_t E              : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_15  : 15; /* [15: 1],       rsvd,        0x0 */
            uint32_t ChClkCG        : 8;  /* [23:16],        r/w,       0xff */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_Config;

    /* 0x14 : DMA_Sync */
    union {
        struct {
            uint32_t DMA_Sync : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_Sync;

    /* 0x18 : DMA_SoftBReq */
    union {
        struct {
            uint32_t SoftBReq : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_SoftBReq;

    /* 0x1C : DMA_SoftLBReq */
    union {
        struct {
            uint32_t SoftLBReq : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_SoftLBReq;

    /* 0x20 : DMA_SoftSReq */
    union {
        struct {
            uint32_t SoftSReq : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_SoftSReq;

    /* 0x24 : DMA_SoftLSReq */
    union {
        struct {
            uint32_t SoftLSReq : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_SoftLSReq;

    /* 0x28  reserved */
    uint8_t RESERVED0x28[216];

    /* 0x100 : DMA2D_C0SrcAddr */
    union {
        struct {
            uint32_t SrcAddr : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA2D_C0SrcAddr;

    /* 0x104 : DMA2D_C0DstAddr */
    union {
        struct {
            uint32_t DstAddr : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA2D_C0DstAddr;

    /* 0x108 : DMA2D_C0LLI */
    union {
        struct {
            uint32_t LLI_EN     : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1 : 1;  /* [    1],       rsvd,        0x0 */
            uint32_t LLI_ADDR   : 30; /* [31: 2],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA2D_C0LLI;

    /* 0x10C : DMA2D_C0_BUS */
    union {
        struct DMA2D_Control_Reg {
            uint32_t TransferSize   : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t SRC_BURST      : 2;  /* [13:12],        r/w,        0x1 */
            uint32_t reserved_14    : 1;  /* [   14],       rsvd,        0x0 */
            uint32_t DST_BURST      : 2;  /* [16:15],        r/w,        0x1 */
            uint32_t reserved_17    : 1;  /* [   17],       rsvd,        0x0 */
            uint32_t SRC_SIZE       : 2;  /* [19:18],        r/w,        0x2 */
            uint32_t reserved_20    : 1;  /* [   20],       rsvd,        0x0 */
            uint32_t DST_SIZE       : 2;  /* [22:21],        r/w,        0x2 */
            uint32_t reserved_23_25 : 3;  /* [25:23],       rsvd,        0x0 */
            uint32_t SI             : 1;  /* [   26],        r/w,        0x1 */
            uint32_t DI             : 1;  /* [   27],        r/w,        0x1 */
            uint32_t Prot           : 3;  /* [30:28],        r/w,        0x0 */
            uint32_t I              : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA2D_C0_BUS;

    /* 0x110 : DMA2D_C0_SRC_CNT */
    union {
        struct {
            uint32_t SRC_X_CNT : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t SRC_Y_CNT : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA2D_C0_SRC_CNT;

    /* 0x114 : DMA2D_C0_SRC_XIC */
    union {
        struct {
            uint32_t SRC_X_INCR : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA2D_C0_SRC_XIC;

    /* 0x118 : DMA2D_C0_SRC_YIC */
    union {
        struct {
            uint32_t SRC_Y_INCR : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA2D_C0_SRC_YIC;

    /* 0x11C : DMA2D_C0_DST_CNT */
    union {
        struct {
            uint32_t DST_X_CNT      : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA2D_C0_DST_CNT;

    /* 0x120 : DMA2D_C0_DST_XIC */
    union {
        struct {
            uint32_t DST_X_INCR : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA2D_C0_DST_XIC;

    /* 0x124 : DMA2D_C0_DST_YIC */
    union {
        struct {
            uint32_t DST_Y_INCR : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA2D_C0_DST_YIC;

    /* 0x128  reserved */
    uint8_t RESERVED0x128[76];

    /* 0x174 : DMA2D_C0_KEY */
    union {
        struct {
            uint32_t KEY0 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t KEY1 : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t KEY2 : 8; /* [23:16],        r/w,        0x0 */
            uint32_t KEY3 : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA2D_C0_KEY;

    /* 0x178 : DMA2D_C0_KEY_EN */
    union {
        struct {
            uint32_t KEY_EN        : 1;  /* [    0],        r/w,        0x0 */
            uint32_t KEY_MODE      : 2;  /* [ 2: 1],        r/w,        0x0 */
            uint32_t reserved_3    : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t KEY_STRB      : 4;  /* [ 7: 4],        r/w,        0x0 */
            uint32_t reserved_8_31 : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA2D_C0_KEY_EN;

    /* 0x17C : DMA2D_C0_CFG */
    union {
        struct {
            uint32_t CH_EN          : 1;  /* [    0],        r/w,        0x0 */
            uint32_t SrcPeripheral  : 5;  /* [ 5: 1],        r/w,        0x0 */
            uint32_t DstPeripheral  : 5;  /* [10: 6],        r/w,        0x0 */
            uint32_t FlowCntrl      : 3;  /* [13:11],        r/w,        0x0 */
            uint32_t AHB_B2B        : 1;  /* [   14],        r/w,        0x0 */
            uint32_t reserved_15    : 1;  /* [   15],       rsvd,        0x0 */
            uint32_t FIFO_Empty     : 1;  /* [   16],          r,        0x0 */
            uint32_t reserved_17_19 : 3;  /* [19:17],       rsvd,        0x0 */
            uint32_t LLICounter     : 10; /* [29:20],          r,        0x0 */
            uint32_t reserved_30    : 1;  /* [   30],       rsvd,        0x0 */
            uint32_t reg_dma_2d_en  : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA2D_C0_CFG;
};

typedef volatile struct dma2d_reg dma2d_reg_t;

#endif /* __DMA2D_REG_H__ */
